Revit 2024 API
WireType.Insulation Property
 The insulation type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public InsulationType Insulation { get; set; }
Visual Basic
Public Property Insulation As InsulationType
	Get
	Set
Visual C++
public:
property InsulationType^ Insulation {
	InsulationType^ get ();
	void set (InsulationType^ value);
}
See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace